####### 과제 1 ##############

pH <- c(4.80, 4.75, 4.92, 4.80, 5.80, 4.80, 4.31, 5.50, 5.00, 4.57, 4.90, 4.63, 4.65, 4.91, 4.35, 4.42, 5.78, 4.95, 4.92, 4.82, 4.80, 4.50, 5.00, 4.65, 4.37, 4.75, 4.48, 4.82, 4.81, 4.51, 4.65, 5.02, 4.35, 4.71, 4.72, 5.00, 5.00, 4.65, 4.58, 5.56)
##### 1.1. 다양한 중심위치 수치측도(평균, 중앙값 ) ###### 


# 평균 
mean(pH)

# 중앙값
median(pH)

# 최빈값 
y <- table(pH)
names(y)[which(y==max(y))] 


##### 1.2. 다양한 산포 수치측도 ###### 
# 분산 
var(pH)

# 표준편차
sd(pH)

# 범위
range(pH)

# 사분위수 범위
IQR(pH)

# 변동계수
sd(pH) / mean(pH)


##### 1.3. 도수분포표 ###### 
freq.table<-table(pH)
freq.table


##### 1.4. 히스토그램 ###### 
hist(pH, breaks=40, main="40일간 비의 pH 값 히스토그램", xlab="pH 값", ylab="빈도", col="skyblue", border="white")
axis(side=1,at=seq(1, 7, 0.1)) # x축 설정

##### 1.5. 줄기잎그림 ###### 
stem(pH)

##### 1.6. 상자그림 ###### 
boxplot(pH, main="pH 상자그림", ylab="pH 값", col="lightblue")